gdasher/qemu/hw/pic32/pic32_devboard.c
/*
 * PIC32MK development board
 *
 * A PIC32MK1024GPK100 and whatever chips you say are wired to it. It is not a
 * model of any particular product: nothing is fitted by default, the board is
 * described on the command line, and what each pin means is the business of
 * whatever is connected to it.
 *
 *   -M pic32mk-devboard,sdcard=spi1:RD8,expanders=spi3:RA4:0/spi3:RA4:1,\
 *      sram=1048576:0x800000 \
 *      -drive file=sd.img,if=sd,format=raw \
 *      -bios firmware.elf -icount shift=3
 *
 * fits an SD card on SPI1 selected by RD8, two MCP23S08 expanders that share
 * RA4 as their select and answer to hardware addresses 0 and 1, and a
 * million-word static RAM on the parallel port selected by address line 23.
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qemu/cutils.h"
#include "hw/core/boards.h"
#include "hw/core/irq.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/split-irq.h"
#include "hw/core/sysbus.h"
#include "hw/chips/mcp23s08.h"
#include "hw/chips/led_demux.h"
#include "hw/pic32/pic32_pps.h"
#include "hw/pic32/pic32_spi.h"
#include "hw/chips/parallel_sram.h"
#include "hw/chips/ws2812.h"
#include "hw/chips/fm_transmitter.h"
#include "hw/display/ws2812_panel.h"
#include "hw/sd/sd.h"
#include "qapi/error.h"
#include "qemu/error-report.h"
#include "qemu/timer.h"
#include "qom/object.h"
#include "system/blockdev.h"
#include "system/block-backend.h"
#include "boot.h"
#include "pic32mk_soc.h"

/*
 * Separators for the list properties: '/' between chips, ':' within one, and
 * '+' between the pins of a group. A comma would read better than the last of
 * those and cannot be used: the machine's own options are comma-separated.
 */
#define SPEC_SEP "/"
#define FIELD_SEP ":"
#define SELECT_SEP "+"

#define MAX_CHIPS 8

typedef struct {
    unsigned spi;       /* which controller, by its number */
    int cs;             /* the port line that selects it */
    unsigned addr;      /* hardware address, for a chip that has one */
    int aux;            /* interrupt line, or -1 */
    uint8_t straps;     /* what its input pins are wired to */
} ChipSpec;

struct PIC32DevboardState {
    MachineState parent_obj;

    PIC32MKSocState soc;

    char *sdcard;
    char *expanders;
    char *sram;
    char *leds;
    char *led_dump;
    char *audio_dump;
    char *fm;
    char *led_order;
    char *logic_trace;
    char *relays;
    bool watchdog;

    ChipSpec sd;
    bool have_sd;
    ChipSpec fm_spec;
    bool have_fm;
    unsigned relay_addr;        /* the expander whose outputs are relays */
    unsigned n_relays;          /* how many of its pins are wired to one */
    ChipSpec expander[MAX_CHIPS];
    unsigned n_expanders;

    ParallelSramState pmp_sram;
    LedDemuxState demux;
    WS2812PanelState panel;

    /*
     * A port line can have more than one consumer -- two expanders share a
     * chip select on this board -- and qdev_connect_gpio_out() replaces rather
     * than adds, so every extra consumer goes through a fan-out.
     */
    qemu_irq extra[PIC32_GPIO_LINES];

    /*
     * What is driving the LED data pin. The port latch drives it while the
     * firmware bit-bangs; peripheral pin select can hand it to SPI4 instead,
     * and then the strings are fed by a DMA channel rather than by the CPU.
     * Both sources stay wired and this says which one the pin listens to.
     */
    struct {
        qemu_irq sink;
        unsigned rpnr;          /* the output select that governs the pin */
        bool from_spi;
        bool gpio_level;
        bool spi_level;
    } led_src;

    VcdTrace *trace;
    int sig_src;                /* which driver the data pin is listening to */
};
typedef struct PIC32DevboardState PIC32DevboardState;

#define TYPE_PIC32_DEVBOARD_MACHINE MACHINE_TYPE_NAME("pic32mk-devboard")
DECLARE_INSTANCE_CHECKER(PIC32DevboardState, PIC32_DEVBOARD_MACHINE,
                         TYPE_PIC32_DEVBOARD_MACHINE)

/*
 * Package pins are named for their port and bit -- RD8 is port D bit 8 -- and
 * the port model numbers its lines the same way.
 */
static int pic32_devboard_pin(const char *name, Error **errp)
{
    unsigned long pin;
    const char *rest;
    unsigned port;

    if (name[0] != 'R' || name[1] < 'A' || name[1] >= 'A' + PIC32_GPIO_PORTS) {
        error_setg(errp, "'%s' is not a port pin", name);
        return -1;
    }
    port = name[1] - 'A';
    if (qemu_strtoul(name + 2, &rest, 10, &pin) < 0 || *rest ||
        pin >= PIC32_GPIO_PINS) {
        error_setg(errp, "'%s' is not a port pin", name);
        return -1;
    }
    return port * PIC32_GPIO_PINS + pin;
}

static bool pic32_devboard_controller(const char *name, unsigned *out,
                                      Error **errp)
{
    unsigned i;

    for (i = 0; i < PIC32_NUM_SPIS; i++) {
        g_autofree char *want = g_strdup_printf("spi%u", pic32_spi_number(i));

        if (!strcmp(name, want)) {
            *out = i;
            return true;
        }
    }
    error_setg(errp, "'%s' is not an SPI controller this machine models",
               name);
    return false;
}

/* Parses "spi<n>:<pin>[:<address>[:<pin>[:<straps>]]]" into one chip's wiring. */
static bool pic32_devboard_parse_chip(const char *spec, const char *kind,
                                      bool has_addr, ChipSpec *out,
                                      Error **errp)
{
    g_auto(GStrv) fields = g_strsplit(spec, FIELD_SEP, 5);
    unsigned n = g_strv_length(fields);
    unsigned long value;

    if (n < 2) {
        error_setg(errp, "%s: '%s' needs a controller and a chip select",
                   kind, spec);
        return false;
    }
    if (!pic32_devboard_controller(fields[0], &out->spi, errp)) {
        return false;
    }
    out->cs = pic32_devboard_pin(fields[1], errp);
    if (out->cs < 0) {
        return false;
    }

    out->addr = 0;
    out->aux = -1;
    if (n > 2 && *fields[2]) {
        if (!has_addr) {
            error_setg(errp, "%s: '%s' has no hardware address", kind, spec);
            return false;
        }
        if (qemu_strtoul(fields[2], NULL, 10, &value) < 0 || value > 3) {
            error_setg(errp, "%s: '%s' is not an address between 0 and 3",
                       kind, fields[2]);
            return false;
        }
        out->addr = value;
    }
    if (n > 3 && *fields[3]) {
        out->aux = pic32_devboard_pin(fields[3], errp);
        if (out->aux < 0) {
            return false;
        }
    }
    out->straps = 0;
    if (n > 4 && *fields[4]) {
        if (!has_addr) {
            error_setg(errp, "%s: '%s' has no input pins to strap", kind,
                       spec);
            return false;
        }
        if (qemu_strtoul(fields[4], NULL, 0, &value) < 0 || value > 0xff) {
            error_setg(errp, "%s: '%s' is not a byte for the input pins",
                       kind, fields[4]);
            return false;
        }
        out->straps = value;
    }
    return true;
}

