gdasher/qemu/hw/pic32/pic32_devboard.c
static bool pic32_devboard_parse_list(const char *value, const char *kind,
                                      bool has_addr, ChipSpec *out,
                                      unsigned *n_out, Error **errp)
{
    g_auto(GStrv) specs = NULL;
    unsigned n = 0;

    *n_out = 0;
    if (!value || !*value) {
        return true;
    }

    specs = g_strsplit(value, SPEC_SEP, -1);
    for (unsigned i = 0; specs[i]; i++) {
        if (!*specs[i]) {
            error_setg(errp, "%s: empty entry in '%s'", kind, value);
            return false;
        }
        if (n == MAX_CHIPS) {
            error_setg(errp, "%s: at most %d may be fitted", kind, MAX_CHIPS);
            return false;
        }
        if (!pic32_devboard_parse_chip(specs[i], kind, has_addr, &out[n],
                                       errp)) {
            return false;
        }
        n++;
    }

    *n_out = n;
    return true;
}

/*
 * Hands out another consumer for a port line. The first goes straight on the
 * output; anything after that inserts a splitter, because a silently replaced
 * connection is invisible until some chip stops answering.
 */
static void pic32_devboard_led_update(PIC32DevboardState *m)
{
    bool level = m->led_src.from_spi ? m->led_src.spi_level
                                     : m->led_src.gpio_level;

    if (m->trace) {
        vcd_trace_set(m->trace, m->sig_src, m->led_src.from_spi);
    }
    qemu_set_irq(m->led_src.sink, level);
}

static void pic32_devboard_led_gpio(void *opaque, int line, int level)
{
    PIC32DevboardState *m = opaque;

    m->led_src.gpio_level = level;
    pic32_devboard_led_update(m);
}

static void pic32_devboard_led_spi(void *opaque, int line, int level)
{
    PIC32DevboardState *m = opaque;

    m->led_src.spi_level = level;
    pic32_devboard_led_update(m);
}

/*
 * A relay moved. They are not pixels and do not latch a frame, so the panel
 * shows them as blocks of their own rather than as part of a string.
 */
static void pic32_devboard_relay(void *opaque, int line, int level)
{
    PIC32DevboardState *m = opaque;

    ws2812_panel_set_switch(&m->panel, line, level);
}

/* Peripheral pin select changed. Only the LED data pin is watched. */
static void pic32_devboard_pps_out(void *opaque, unsigned reg, unsigned sel)
{
    PIC32DevboardState *m = opaque;

    if (reg != m->led_src.rpnr) {
        return;
    }
    m->led_src.from_spi = sel == PIC32_PPS_OUT_SDO4;
    pic32_devboard_led_update(m);
}

static void pic32_devboard_drive(PIC32DevboardState *m, int line,
                                 qemu_irq sink)
{
    DeviceState *gpio = DEVICE(&m->soc.gpio);
    DeviceState *split;

    if (!m->extra[line]) {
        qdev_connect_gpio_out_named(gpio, PIC32_GPIO_OUT_GPIO, line, sink);
        m->extra[line] = sink;
        return;
    }

    split = qdev_new(TYPE_SPLIT_IRQ);
    qdev_prop_set_uint32(split, "num-lines", 2);
    qdev_realize_and_unref(split, NULL, &error_abort);
    qdev_connect_gpio_out(split, 0, m->extra[line]);
    qdev_connect_gpio_out(split, 1, sink);
    qdev_connect_gpio_out_named(gpio, PIC32_GPIO_OUT_GPIO, line,
                                qdev_get_gpio_in(split, 0));
    m->extra[line] = qdev_get_gpio_in(split, 0);
}

/*
 * An SD card in SPI mode, on the bus and selected by a port pin. The firmware
 * drives that pin itself -- Harmony's driver is given the pin number and the
 * controller's own select is disabled -- so the card takes its select from the
 * port rather than from the SPI controller.
 */
static void pic32_devboard_fit_sd(PIC32DevboardState *m, const ChipSpec *spec)
{
    DriveInfo *di = drive_get(IF_SD, 0, 0);
    DeviceState *ssi_sd, *card;

    ssi_sd = ssi_create_peripheral(m->soc.spi[spec->spi].ssi, "ssi-sd");

    card = qdev_new(TYPE_SD_CARD_SPI);
    qdev_prop_set_drive_err(card, "drive",
                            di ? blk_by_legacy_dinfo(di) : NULL, &error_fatal);
    qdev_realize_and_unref(card, qdev_get_child_bus(ssi_sd, "sd-bus"),
                           &error_fatal);

    pic32_devboard_drive(m, spec->cs,
                         qdev_get_gpio_in_named(ssi_sd, SSI_GPIO_CS, 0));
}

static void pic32_devboard_fit_fm(PIC32DevboardState *m, const ChipSpec *spec)
{
    DeviceState *chip = qdev_new(TYPE_FM_TRANSMITTER);

    if (m->audio_dump) {
        qdev_prop_set_string(chip, "dump", m->audio_dump);
    }
    /*
     * The transmitter shares SPI3 with the port expanders, whose select
     * indexes are their hardware addresses (0 and 1); the index only has to
     * be distinct, since a port pin does the selecting here too.
     */
    qdev_prop_set_uint8(chip, "cs", 0x7f);
    ssi_realize_and_unref(chip, m->soc.spi[spec->spi].ssi, &error_fatal);

    pic32_devboard_drive(m, spec->cs,
                         qdev_get_gpio_in_named(chip, SSI_GPIO_CS, 0));
}

/*
 * The relays, as "<address>[:<count>]": which expander drives them, and how
 * many of its eight pins reach one. An expander is already described by the
 * expanders option; this only says what the board hung off the one it names.
 */
static bool pic32_devboard_parse_relays(PIC32DevboardState *m, Error **errp)
{
    g_auto(GStrv) fields = g_strsplit(m->relays, FIELD_SEP, 2);
    unsigned n = g_strv_length(fields);
    unsigned long value;

    if (qemu_strtoul(fields[0], NULL, 0, &value) < 0 || value > 3) {
        error_setg(errp, "relays: '%s' is not an expander address between 0 "
                   "and 3", fields[0]);
        return false;
    }
    m->relay_addr = value;

    m->n_relays = MCP23S08_PINS;
    if (n > 1 && *fields[1]) {
        if (qemu_strtoul(fields[1], NULL, 0, &value) < 0 ||
            !value || value > MCP23S08_PINS) {
            error_setg(errp, "relays: '%s' is not a count between 1 and %d",
                       fields[1], MCP23S08_PINS);
            return false;
        }
        m->n_relays = value;
    }
    return true;
}

static void pic32_devboard_fit_expander(PIC32DevboardState *m,
                                        const ChipSpec *spec)
{
    DeviceState *chip = qdev_new(TYPE_MCP23S08);

    qdev_prop_set_uint8(chip, "address", spec->addr);
    /*
     * The bus insists every peripheral on it has a different select index,
     * because a controller that drives chip select by index has no other way
     * to tell them apart. These are selected by a port pin instead, and two of
     * them share it, so the index is only there to be distinct -- the chip's
     * hardware address serves.
     */
    qdev_prop_set_uint8(chip, "cs", spec->addr);
    ssi_realize_and_unref(chip, m->soc.spi[spec->spi].ssi, &error_fatal);

    pic32_devboard_drive(m, spec->cs,
                         qdev_get_gpio_in_named(chip, SSI_GPIO_CS, 0));
    /*
     * Whatever the board wires the input pins to. On this one they are a
     * switch bank the firmware reads its device ID off, and a device ID
     * decides which of a movie's regions belong to this board -- so a board
     * left unstrapped plays only the movies written for device zero.
     */
    for (unsigned bit = 0; bit < 8; bit++) {
        qemu_set_irq(qdev_get_gpio_in_named(chip, MCP23S08_IN_GPIO, bit),
                     (spec->straps >> bit) & 1);
    }
    if (spec->aux >= 0) {
        qdev_connect_gpio_out_named(chip, MCP23S08_INT_GPIO, 0,
                                    qdev_get_gpio_in_named(
                                        DEVICE(&m->soc.gpio),
                                        PIC32_GPIO_IN_GPIO, spec->aux));
    }
    if (m->n_relays && spec->addr == m->relay_addr) {
        unsigned i;

        for (i = 0; i < m->n_relays; i++) {
            qdev_connect_gpio_out_named(chip, MCP23S08_OUT_GPIO, i,
                                        qemu_allocate_irq(
                                            pic32_devboard_relay, m, i));
        }
    }
}

