gdasher/qemu/hw/pic32/pic32_devboard.c
/*
 * The static RAM on the parallel port, as "<words>[:<select>]" -- how many
 * locations it has, and which address line the board uses as its chip select.
 * The XMASNg board fits a 2 MB part and selects it with A23:
 *
 *   sram=1048576:0x800000
 */
static bool pic32_devboard_fit_sram(PIC32DevboardState *m, Error **errp)
{
    static const PIC32PmpTarget target = {
        .read = parallel_sram_read,
        .write = parallel_sram_write,
    };
    g_auto(GStrv) fields = g_strsplit(m->sram, FIELD_SEP, 2);
    unsigned n = g_strv_length(fields);
    uint64_t words;
    unsigned long select = 0;

    if (n < 1 || qemu_strtou64(fields[0], NULL, 0, &words) < 0 || !words) {
        error_setg(errp, "sram: '%s' does not start with a size in words",
                   m->sram);
        return false;
    }
    if (n > 1 && qemu_strtoul(fields[1], NULL, 0, &select) < 0) {
        error_setg(errp, "sram: '%s' is not an address line", fields[1]);
        return false;
    }

    object_initialize_child(OBJECT(m), "pmp-sram", &m->pmp_sram,
                            TYPE_PARALLEL_SRAM);
    qdev_prop_set_uint64(DEVICE(&m->pmp_sram), "words", words);
    qdev_prop_set_uint32(DEVICE(&m->pmp_sram), "select", select);
    if (!sysbus_realize(SYS_BUS_DEVICE(&m->pmp_sram), errp)) {
        return false;
    }
    pic32_pmp_attach(&m->soc.pmp, &target, &m->pmp_sram);
    return true;
}

/*
 * The LED strings, as "<data>:<count>x<pixels>[:<select>,...[:<enable>]]".
 * They are bit-banged from one pin through a demultiplexer that picks which
 * string is listening, which is how a part with one spare output drives eight:
 *
 *   leds=RA14:8x600:RA1+RB0+RB1:RA11
 *
 * The strings are watched by a panel, which shows them as one row of pixels
 * each and writes every frame to the file named by led-dump.
 */
static bool pic32_devboard_fit_leds(PIC32DevboardState *m, Error **errp)
{
    g_auto(GStrv) fields = g_strsplit(m->leds, FIELD_SEP, 4);
    unsigned n = g_strv_length(fields);
    unsigned long strings, pixels;
    const char *rest;
    int din, enable = -1;
    unsigned i;

    if (n < 2) {
        error_setg(errp, "leds: '%s' needs a data pin and a size", m->leds);
        return false;
    }
    din = pic32_devboard_pin(fields[0], errp);
    if (din < 0) {
        return false;
    }
    if (qemu_strtoul(fields[1], &rest, 10, &strings) < 0 || *rest != 'x' ||
        qemu_strtoul(rest + 1, NULL, 10, &pixels) < 0 ||
        !strings || strings > LED_DEMUX_MAX_OUTPUTS || !pixels) {
        error_setg(errp, "leds: '%s' is not <strings>x<pixels>", fields[1]);
        return false;
    }
    if (n > 3 && *fields[3]) {
        enable = pic32_devboard_pin(fields[3], errp);
        if (enable < 0) {
            return false;
        }
    }

    object_initialize_child(OBJECT(m), "led-demux", &m->demux,
                            TYPE_LED_DEMUX);
    qdev_prop_set_uint32(DEVICE(&m->demux), "outputs", strings);
    /*
     * A board that wires no enable line has nothing to switch the part on, so
     * it starts on. One that does starts off, as a pulled-up input would.
     */
    qdev_prop_set_bit(DEVICE(&m->demux), "disabled", enable >= 0);
    if (!sysbus_realize(SYS_BUS_DEVICE(&m->demux), errp)) {
        return false;
    }

    /*
     * The data pin has two possible drivers. The port latch is one; SPI4's
     * serial output is the other, once the firmware points the pin's output
     * select at it. Both are wired, and peripheral pin select says which one
     * the demultiplexer hears. RPAnR is one register per bit of port A; the
     * other ports are not laid out to the same formula and no board here
     * needs them.
     */
    m->led_src.sink = qdev_get_gpio_in_named(DEVICE(&m->demux),
                                             LED_DEMUX_IN_GPIO, 0);
    if (din / PIC32_GPIO_PINS == 0) {
        m->led_src.rpnr = PIC32_PPS_OUT(0x1600 + (din % PIC32_GPIO_PINS) * 4);
        pic32_pps_set_out_notifier(&m->soc.pps, pic32_devboard_pps_out, m);
    } else {
        m->led_src.rpnr = PIC32_PPS_REGS;       /* never matches */
        warn_report("leds: the data pin is not on port A, so SPI cannot be "
                    "routed to it");
    }

    pic32_devboard_drive(m, din,
                         qemu_allocate_irq(pic32_devboard_led_gpio, m, 0));
    for (i = 0; i < PIC32_NUM_SPIS; i++) {
        if (pic32_spi_number(i) == 4) {
            qdev_connect_gpio_out_named(DEVICE(&m->soc.spi[i]),
                                        PIC32_SPI_SDO_GPIO, 0,
                                        qemu_allocate_irq(
                                            pic32_devboard_led_spi, m, 0));
        }
    }
    if (enable >= 0) {
        pic32_devboard_drive(m, enable,
                             qdev_get_gpio_in_named(DEVICE(&m->demux),
                                                    LED_DEMUX_ENABLE_GPIO, 0));
    }
    if (n > 2 && *fields[2]) {
        g_auto(GStrv) pins = g_strsplit(fields[2], SELECT_SEP, -1);

        for (i = 0; pins[i]; i++) {
            int line = pic32_devboard_pin(pins[i], errp);

            if (line < 0) {
                return false;
            }
            pic32_devboard_drive(m, line,
                                 qdev_get_gpio_in_named(DEVICE(&m->demux),
                                                        LED_DEMUX_SELECT_GPIO,
                                                        i));
        }
    }

    object_initialize_child(OBJECT(m), "led-panel", &m->panel,
                            TYPE_WS2812_PANEL);
    qdev_prop_set_uint32(DEVICE(&m->panel), "strips", strings);
    qdev_prop_set_uint32(DEVICE(&m->panel), "pixels", pixels);
    qdev_prop_set_uint32(DEVICE(&m->panel), "switches", m->n_relays);
    if (m->led_dump) {
        qdev_prop_set_string(DEVICE(&m->panel), "dump", m->led_dump);
    }
    if (!sysbus_realize(SYS_BUS_DEVICE(&m->panel), errp)) {
        return false;
    }

    for (i = 0; i < strings; i++) {
        DeviceState *strip = qdev_new(TYPE_WS2812);
        g_autofree char *name = g_strdup_printf("led%u", i);

        qdev_prop_set_uint32(strip, "pixels", pixels);
        qdev_prop_set_string(strip, "name", name);
        if (m->led_order) {
            qdev_prop_set_string(strip, "order", m->led_order);
        }
        object_property_add_child(OBJECT(m), name, OBJECT(strip));
        ws2812_panel_add(&m->panel, WS2812(strip));
        sysbus_realize_and_unref(SYS_BUS_DEVICE(strip), &error_fatal);

        qdev_connect_gpio_out_named(DEVICE(&m->demux), LED_DEMUX_OUT_GPIO, i,
                                    qdev_get_gpio_in_named(strip,
                                                           WS2812_IN_GPIO, 0));
    }
    return true;
}

