gdasher/qemu/hw/pic32/pic32_devboard.c
/*
 * The logic trace, as "<file>[:<start ms>[:<length ms>]]". It watches the LED
 * lines, which are the fastest thing on the board and the reason the window
 * exists: a bit-banged string changes its data line twice a microsecond for
 * as long as the movie lasts, so a whole run is gigabytes of waveform. The
 * default window is a quarter of a second from the start of the run, which is
 * a frame or two of most movies.
 */
static bool pic32_devboard_fit_trace(PIC32DevboardState *m, Error **errp)
{
    g_auto(GStrv) fields = g_strsplit(m->logic_trace, FIELD_SEP, 3);
    unsigned n = g_strv_length(fields);
    uint64_t start_ms = 0, len_ms = 250;

    if (!*fields[0]) {
        error_setg(errp, "logic-trace: '%s' names no file", m->logic_trace);
        return false;
    }
    if (n > 1 && qemu_strtou64(fields[1], NULL, 10, &start_ms) < 0) {
        error_setg(errp, "logic-trace: '%s' is not a start in ms", fields[1]);
        return false;
    }
    if (n > 2 && qemu_strtou64(fields[2], NULL, 10, &len_ms) < 0) {
        error_setg(errp, "logic-trace: '%s' is not a length in ms", fields[2]);
        return false;
    }

    m->trace = vcd_trace_new(fields[0], start_ms * SCALE_MS, len_ms * SCALE_MS,
                             errp);
    if (!m->trace) {
        return false;
    }
    led_demux_set_trace(&m->demux, m->trace);
    m->sig_src = vcd_trace_add(m->trace, "spi_drives_din", 1);
    return true;
}

static void pic32_devboard_init(MachineState *machine)
{
    PIC32DevboardState *m = PIC32_DEVBOARD_MACHINE(machine);
    const char *firmware = machine->firmware ?: machine->kernel_filename;
    unsigned n, i;

    if (m->sdcard && *m->sdcard) {
        if (!pic32_devboard_parse_chip(m->sdcard, "sdcard", false, &m->sd,
                                       &error_fatal)) {
            exit(1);
        }
        m->have_sd = true;
    }
    if (m->fm && *m->fm) {
        if (!pic32_devboard_parse_chip(m->fm, "fm", false, &m->fm_spec,
                                       &error_fatal)) {
            exit(1);
        }
        m->have_fm = true;
    } else if (m->audio_dump && *m->audio_dump) {
        if (!pic32_devboard_parse_chip("spi3:RD15", "fm", false, &m->fm_spec,
                                       &error_fatal)) {
            exit(1);
        }
        m->have_fm = true;
    }
    if (!pic32_devboard_parse_list(m->expanders, "expanders", true,
                                   m->expander, &n, &error_fatal)) {
        exit(1);
    }
    m->n_expanders = n;

    object_initialize_child(OBJECT(machine), "soc", &m->soc,
                            TYPE_PIC32MK1024GPK100_SOC);
    pic32mk_soc_set_watchdog(&m->soc, m->watchdog);
    sysbus_realize(SYS_BUS_DEVICE(&m->soc), &error_fatal);

    if (m->relays && *m->relays &&
        !pic32_devboard_parse_relays(m, &error_fatal)) {
        exit(1);
    }
    if (m->sram && *m->sram && !pic32_devboard_fit_sram(m, &error_fatal)) {
        exit(1);
    }
    if (m->leds && *m->leds && !pic32_devboard_fit_leds(m, &error_fatal)) {
        exit(1);
    }
    if (m->logic_trace && *m->logic_trace) {
        if (!m->leds || !*m->leds) {
            error_report("logic-trace: there are no LED lines to trace");
            exit(1);
        }
        if (!pic32_devboard_fit_trace(m, &error_fatal)) {
            exit(1);
        }
    }
    if (m->have_sd) {
        pic32_devboard_fit_sd(m, &m->sd);
    }
    if (m->have_fm) {
        pic32_devboard_fit_fm(m, &m->fm_spec);
    }
    for (i = 0; i < m->n_expanders; i++) {
        pic32_devboard_fit_expander(m, &m->expander[i]);
    }

    if (firmware && !pic32_load_firmware(firmware)) {
        exit(1);
    }
}

static char *pic32_devboard_get_sdcard(Object *obj, Error **errp)
{
    return g_strdup(PIC32_DEVBOARD_MACHINE(obj)->sdcard);
}

static void pic32_devboard_set_sdcard(Object *obj, const char *value,
                                      Error **errp)
{
    PIC32DevboardState *m = PIC32_DEVBOARD_MACHINE(obj);

    g_free(m->sdcard);
    m->sdcard = g_strdup(value);
}

static char *pic32_devboard_get_expanders(Object *obj, Error **errp)
{
    return g_strdup(PIC32_DEVBOARD_MACHINE(obj)->expanders);
}

static void pic32_devboard_set_expanders(Object *obj, const char *value,
                                         Error **errp)
{
    PIC32DevboardState *m = PIC32_DEVBOARD_MACHINE(obj);

    g_free(m->expanders);
    m->expanders = g_strdup(value);
}

static char *pic32_devboard_get_sram(Object *obj, Error **errp)
{
    return g_strdup(PIC32_DEVBOARD_MACHINE(obj)->sram);
}

static void pic32_devboard_set_sram(Object *obj, const char *value,
                                    Error **errp)
{
    PIC32DevboardState *m = PIC32_DEVBOARD_MACHINE(obj);

    g_free(m->sram);
    m->sram = g_strdup(value);
}

static char *pic32_devboard_get_leds(Object *obj, Error **errp)
{
    return g_strdup(PIC32_DEVBOARD_MACHINE(obj)->leds);
}

static void pic32_devboard_set_leds(Object *obj, const char *value,
                                    Error **errp)
{
    PIC32DevboardState *m = PIC32_DEVBOARD_MACHINE(obj);

    g_free(m->leds);
    m->leds = g_strdup(value);
}

static char *pic32_devboard_get_led_dump(Object *obj, Error **errp)
{
    return g_strdup(PIC32_DEVBOARD_MACHINE(obj)->led_dump);
}

static void pic32_devboard_set_led_dump(Object *obj, const char *value,
                                        Error **errp)
{
    PIC32DevboardState *m = PIC32_DEVBOARD_MACHINE(obj);

    g_free(m->led_dump);
    m->led_dump = g_strdup(value);
}

static char *pic32_devboard_get_audio_dump(Object *obj, Error **errp)
{
    return g_strdup(PIC32_DEVBOARD_MACHINE(obj)->audio_dump);
}

static void pic32_devboard_set_audio_dump(Object *obj, const char *value,
                                          Error **errp)
{
    PIC32DevboardState *m = PIC32_DEVBOARD_MACHINE(obj);

    g_free(m->audio_dump);
    m->audio_dump = g_strdup(value);
}

static char *pic32_devboard_get_fm(Object *obj, Error **errp)
{
    return g_strdup(PIC32_DEVBOARD_MACHINE(obj)->fm);
}

static void pic32_devboard_set_fm(Object *obj, const char *value,
                                  Error **errp)
{
    PIC32DevboardState *m = PIC32_DEVBOARD_MACHINE(obj);

    g_free(m->fm);
    m->fm = g_strdup(value);
}

static char *pic32_devboard_get_led_order(Object *obj, Error **errp)
{
    return g_strdup(PIC32_DEVBOARD_MACHINE(obj)->led_order);
}

static void pic32_devboard_set_led_order(Object *obj, const char *value,
                                         Error **errp)
{
    PIC32DevboardState *m = PIC32_DEVBOARD_MACHINE(obj);

    g_free(m->led_order);
    m->led_order = g_strdup(value);
}

static char *pic32_devboard_get_relays(Object *obj, Error **errp)
{
    return g_strdup(PIC32_DEVBOARD_MACHINE(obj)->relays);
}

static void pic32_devboard_set_relays(Object *obj, const char *value,
                                      Error **errp)
{
    PIC32DevboardState *m = PIC32_DEVBOARD_MACHINE(obj);

