gdasher/qemu/hw/pic32/pic32_devboard.c
    g_free(m->relays);
    m->relays = g_strdup(value);
}

static char *pic32_devboard_get_logic_trace(Object *obj, Error **errp)
{
    return g_strdup(PIC32_DEVBOARD_MACHINE(obj)->logic_trace);
}

static void pic32_devboard_set_logic_trace(Object *obj, const char *value,
                                           Error **errp)
{
    PIC32DevboardState *m = PIC32_DEVBOARD_MACHINE(obj);

    g_free(m->logic_trace);
    m->logic_trace = g_strdup(value);
}

static bool pic32_devboard_get_watchdog(Object *obj, Error **errp)
{
    return PIC32_DEVBOARD_MACHINE(obj)->watchdog;
}

static void pic32_devboard_set_watchdog(Object *obj, bool value, Error **errp)
{
    PIC32_DEVBOARD_MACHINE(obj)->watchdog = value;
}

static void pic32_devboard_machine_class_init(ObjectClass *oc, const void *data)
{
    MachineClass *mc = MACHINE_CLASS(oc);

    mc->desc = "Microchip PIC32MK development board";
    mc->init = pic32_devboard_init;
    mc->default_cpu_type = MIPS_CPU_TYPE_NAME("microAptiv-MCU");
    mc->no_floppy = 1;
    mc->no_cdrom = 1;
    mc->no_parallel = 1;
    mc->min_cpus = 1;
    mc->max_cpus = 1;
    mc->default_ram_id = NULL;

    object_class_property_add_str(oc, "sdcard", pic32_devboard_get_sdcard,
                                  pic32_devboard_set_sdcard);
    object_class_property_set_description(oc, "sdcard",
        "SD card as controller:chip-select, e.g. spi1:RD8");

    object_class_property_add_str(oc, "sram", pic32_devboard_get_sram,
                                  pic32_devboard_set_sram);
    object_class_property_set_description(oc, "sram",
        "static RAM on the parallel port as words[:chip-select-line], "
        "e.g. 1048576:0x800000");

    object_class_property_add_str(oc, "leds", pic32_devboard_get_leds,
                                  pic32_devboard_set_leds);
    object_class_property_set_description(oc, "leds",
        "WS2812 strings as data-pin:count x pixels[:select-pins[:enable-pin]],"
        " e.g. RA14:8x600:RA1+RB0+RB1:RA11");

    object_class_property_add_str(oc, "led-dump",
                                  pic32_devboard_get_led_dump,
                                  pic32_devboard_set_led_dump);
    object_class_property_set_description(oc, "led-dump",
        "write every latched LED frame to this file");

    object_class_property_add_str(oc, "audio-dump",
                                  pic32_devboard_get_audio_dump,
                                  pic32_devboard_set_audio_dump);
    object_class_property_set_description(oc, "audio-dump",
        "write every received FM audio packet and config command to this file");

    object_class_property_add_str(oc, "fm",
                                  pic32_devboard_get_fm,
                                  pic32_devboard_set_fm);
    object_class_property_set_description(oc, "fm",
        "FM transmitter as controller:chip-select, e.g. spi3:RD15");

    object_class_property_add_str(oc, "relays", pic32_devboard_get_relays,
                                  pic32_devboard_set_relays);
    object_class_property_set_description(oc, "relays",
        "on/off outputs on an expander, as address[:count], e.g. 1:3");

    object_class_property_add_str(oc, "logic-trace",
                                  pic32_devboard_get_logic_trace,
                                  pic32_devboard_set_logic_trace);
    object_class_property_set_description(oc, "logic-trace",
        "write a VCD of the LED lines to this file, as "
        "file[:start-ms[:length-ms]], e.g. leds.vcd:2000:250");

    object_class_property_add_str(oc, "led-order",
                                  pic32_devboard_get_led_order,
                                  pic32_devboard_set_led_order);
    object_class_property_set_description(oc, "led-order",
        "byte order the strings expect, 'grb' as the data sheet has it or "
        "'rgb' for the parts that take red first");

    object_class_property_add_bool(oc, "watchdog",
                                   pic32_devboard_get_watchdog,
                                   pic32_devboard_set_watchdog);
    object_class_property_set_description(oc, "watchdog",
        "arm the watchdog at reset, as the configuration words would. Off by "
        "default: a firmware that stops feeding it is supposed to be reset, "
        "which during bring-up hides whatever stopped it");

    object_class_property_add_str(oc, "expanders",
                                  pic32_devboard_get_expanders,
                                  pic32_devboard_set_expanders);
    object_class_property_set_description(oc, "expanders",
        "MCP23S08 expanders as "
        "controller:chip-select[:address[:interrupt[:input-pins]]] "
        "separated by '/', e.g. spi3:RA4:0::1/spi3:RA4:1");
}

static const TypeInfo pic32_devboard_machine_types[] = {
    {
        .name = TYPE_PIC32_DEVBOARD_MACHINE,
        .parent = TYPE_MACHINE,
        .instance_size = sizeof(PIC32DevboardState),
        .class_init = pic32_devboard_machine_class_init,
    },
};

DEFINE_TYPES(pic32_devboard_machine_types)
